src/main/resources/xmls/salesforcequery/CreateReqOpportunityRequest3.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
	<Header>
		<SessionHeader xmlns="urn:partner.soap.sforce.com">
			<sessionId></sessionId>
		</SessionHeader>
	</Header>
	<Body>
		<create xmlns="urn:partner.soap.sforce.com">
			<sObjects>
				<type xmlns="urn:sobject.partner.soap.sforce.com">Opportunity</type>
				<Name xmlns="">test</Name>
					<RecordTypeId xmlns=""></RecordTypeId>
			<AccountId xmlns=""></AccountId>
				<Req_Hiring_Manager__c xmlns=""></Req_Hiring_Manager__c>
				<StageName xmlns=""></StageName>
				<Req_Total_Positions__c xmlns=""></Req_Total_Positions__c>
				<Req_Product__c xmlns=""></Req_Product__c>
				<Req_Job_Title__c xmlns=""></Req_Job_Title__c>
				<Req_TGS_Requirement__c xmlns=""></Req_TGS_Requirement__c>
				<Req_Job_Level__c xmlns=""></Req_Job_Level__c>
				<Req_Job_Description__c xmlns=""></Req_Job_Description__c>
				<Req_Draft_Reason__c xmlns=""></Req_Draft_Reason__c>
				<EnterpriseReqSkills__c xmlns=""></EnterpriseReqSkills__c>
				<Req_Worksite_City__c xmlns=""></Req_Worksite_City__c>
				<Req_Worksite_Country__c xmlns=""></Req_Worksite_Country__c>
				<Req_Worksite_Street__c xmlns=""></Req_Worksite_Street__c>
				<Req_Worksite_Postal_Code__c xmlns=""></Req_Worksite_Postal_Code__c>
				<Req_Worksite_State__c xmlns=""></Req_Worksite_State__c>
				<OpCo__c xmlns=""></OpCo__c>
				<Req_Division__c xmlns=""></Req_Division__c>
				<CloseDate xmlns=""></CloseDate>
				<Req_Qualification__c xmlns=""></Req_Qualification__c>
				<Legacy_Product__c xmlns=""></Legacy_Product__c>
				<Organization_Office__c xmlns=""></Organization_Office__c>
			</sObjects>Legacy_Product__c
		</create>
	</Body>
</Envelope>